---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentCreatingEventArgs
source: html/42d1d393-2f1a-d665-a405-14ea36ba2f84.htm
---
# DocumentCreatingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.